# SetToolByIndex

## Description
Similar to SetTool. Takes the internal ID of a tool.

```pascal
FUNCTION SetToolByIndex(toolIndex : INTEGER): BOOLEAN;
```

```python
def vs.SetToolByIndex(toolIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2014

## Category
* Utility